{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "9e5ecd3f",
   "metadata": {},
   "source": [
    "# Data import"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5455bbd",
   "metadata": {},
   "source": [
    "This is a short demonstration that shows you how you can import raw data into the Neo4j database without tools like jQAssistant (because you cannot use them in your programming language)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d164dac2",
   "metadata": {},
   "source": [
    "## Import dependencies (from jdeps)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dbd01617",
   "metadata": {},
   "source": [
    "Import dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5efea052",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>raw</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>spring-petclinic-2.4.5.jar -&gt; not found</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>spring-petclinic-2.4.5.jar -&gt; /usr/lib/jvm/jav...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.boot.loader.ClassPathIn...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.boot.loader.ClassPathIn...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.boot.loader.ClassPathIn...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 raw\n",
       "0            spring-petclinic-2.4.5.jar -> not found\n",
       "1  spring-petclinic-2.4.5.jar -> /usr/lib/jvm/jav...\n",
       "2     org.springframework.boot.loader.ClassPathIn...\n",
       "3     org.springframework.boot.loader.ClassPathIn...\n",
       "4     org.springframework.boot.loader.ClassPathIn..."
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "deps = pd.read_csv(\"data/spring_petclinic_deps.txt\", names=[\"raw\"], sep=\"\\n\")\n",
    "deps.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8d1e8774",
   "metadata": {},
   "source": [
    "Normalize data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "1c6b1c36",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>raw</th>\n",
       "      <th>from</th>\n",
       "      <th>to</th>\n",
       "      <th>type</th>\n",
       "      <th>name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.boot.loader.ClassPathIn...</td>\n",
       "      <td>org.springframework.boot.loader.ClassPathIndex...</td>\n",
       "      <td>java.io.BufferedReader</td>\n",
       "      <td></td>\n",
       "      <td>ClassPathIndexFile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.boot.loader.ClassPathIn...</td>\n",
       "      <td>org.springframework.boot.loader.ClassPathIndex...</td>\n",
       "      <td>java.io.File</td>\n",
       "      <td></td>\n",
       "      <td>ClassPathIndexFile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.boot.loader.ClassPathIn...</td>\n",
       "      <td>org.springframework.boot.loader.ClassPathIndex...</td>\n",
       "      <td>java.io.FileInputStream</td>\n",
       "      <td></td>\n",
       "      <td>ClassPathIndexFile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>org.springframework.boot.loader.ClassPathIn...</td>\n",
       "      <td>org.springframework.boot.loader.ClassPathIndex...</td>\n",
       "      <td>java.io.IOException</td>\n",
       "      <td></td>\n",
       "      <td>ClassPathIndexFile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>org.springframework.boot.loader.ClassPathIn...</td>\n",
       "      <td>org.springframework.boot.loader.ClassPathIndex...</td>\n",
       "      <td>java.io.InputStream</td>\n",
       "      <td></td>\n",
       "      <td>ClassPathIndexFile</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 raw  \\\n",
       "2     org.springframework.boot.loader.ClassPathIn...   \n",
       "3     org.springframework.boot.loader.ClassPathIn...   \n",
       "4     org.springframework.boot.loader.ClassPathIn...   \n",
       "5     org.springframework.boot.loader.ClassPathIn...   \n",
       "6     org.springframework.boot.loader.ClassPathIn...   \n",
       "\n",
       "                                                from                       to  \\\n",
       "2  org.springframework.boot.loader.ClassPathIndex...   java.io.BufferedReader   \n",
       "3  org.springframework.boot.loader.ClassPathIndex...             java.io.File   \n",
       "4  org.springframework.boot.loader.ClassPathIndex...  java.io.FileInputStream   \n",
       "5  org.springframework.boot.loader.ClassPathIndex...      java.io.IOException   \n",
       "6  org.springframework.boot.loader.ClassPathIndex...      java.io.InputStream   \n",
       "\n",
       "  type                name  \n",
       "2       ClassPathIndexFile  \n",
       "3       ClassPathIndexFile  \n",
       "4       ClassPathIndexFile  \n",
       "5       ClassPathIndexFile  \n",
       "6       ClassPathIndexFile  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# class entries begin with three whitespaces\n",
    "deps = deps[deps['raw'].str.startswith(\"   \")]\n",
    "# separates the source from the target\n",
    "splitted = deps['raw'].str.split(\"->\", n=1, expand=True)\n",
    "# remove whitespaces from source\n",
    "deps['from'] = splitted[0].str.strip()\n",
    "# get the target and the artifact names\n",
    "splitted_2 = splitted[1].str.split(\" \", n=2)\n",
    "deps['to'] = splitted_2.str[1]\n",
    "deps['type'] = splitted_2.str[2].str.strip()\n",
    "deps['name'] = deps['from'].str.split(\".\").str[-1]\n",
    "deps.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "98dca663",
   "metadata": {},
   "source": [
    "Focus on core application"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "cb0e0490",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>raw</th>\n",
       "      <th>from</th>\n",
       "      <th>to</th>\n",
       "      <th>type</th>\n",
       "      <th>name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>867</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>java.lang.Class</td>\n",
       "      <td></td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>868</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>java.lang.Object</td>\n",
       "      <td></td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>869</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>java.lang.String</td>\n",
       "      <td></td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>870</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>org.springframework.boot.SpringApplication</td>\n",
       "      <td>not found</td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>871</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>org.springframework.boot.autoconfigure.SpringB...</td>\n",
       "      <td>not found</td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   raw  \\\n",
       "867     org.springframework.samples.petclinic.PetCl...   \n",
       "868     org.springframework.samples.petclinic.PetCl...   \n",
       "869     org.springframework.samples.petclinic.PetCl...   \n",
       "870     org.springframework.samples.petclinic.PetCl...   \n",
       "871     org.springframework.samples.petclinic.PetCl...   \n",
       "\n",
       "                                                  from  \\\n",
       "867  org.springframework.samples.petclinic.PetClini...   \n",
       "868  org.springframework.samples.petclinic.PetClini...   \n",
       "869  org.springframework.samples.petclinic.PetClini...   \n",
       "870  org.springframework.samples.petclinic.PetClini...   \n",
       "871  org.springframework.samples.petclinic.PetClini...   \n",
       "\n",
       "                                                    to       type  \\\n",
       "867                                    java.lang.Class              \n",
       "868                                   java.lang.Object              \n",
       "869                                   java.lang.String              \n",
       "870         org.springframework.boot.SpringApplication  not found   \n",
       "871  org.springframework.boot.autoconfigure.SpringB...  not found   \n",
       "\n",
       "                     name  \n",
       "867  PetClinicApplication  \n",
       "868  PetClinicApplication  \n",
       "869  PetClinicApplication  \n",
       "870  PetClinicApplication  \n",
       "871  PetClinicApplication  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "petclinic_deps = deps[\n",
    "    (\n",
    "        deps['from'].str.startswith(\"org.springframework.samples.petclinic\") |\n",
    "        deps['to'].str.startswith(\"org.springframework.samples.petclinic\")\n",
    "    )\n",
    "    ].copy()\n",
    "petclinic_deps.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "47cba5cc",
   "metadata": {},
   "source": [
    "## Import coverage data (from JaCoCo)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e7baf4b",
   "metadata": {},
   "source": [
    "Import dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "758742cb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>PACKAGE</th>\n",
       "      <th>CLASS</th>\n",
       "      <th>LINE_MISSED</th>\n",
       "      <th>LINE_COVERED</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic</td>\n",
       "      <td>PetclinicInitializer</td>\n",
       "      <td>0</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>NamedEntity</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>Specialty</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>PetType</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>Vets</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       PACKAGE                 CLASS  \\\n",
       "0        org.springframework.samples.petclinic  PetclinicInitializer   \n",
       "1  org.springframework.samples.petclinic.model           NamedEntity   \n",
       "2  org.springframework.samples.petclinic.model             Specialty   \n",
       "3  org.springframework.samples.petclinic.model               PetType   \n",
       "4  org.springframework.samples.petclinic.model                  Vets   \n",
       "\n",
       "   LINE_MISSED  LINE_COVERED  \n",
       "0            0            24  \n",
       "1            1             4  \n",
       "2            0             1  \n",
       "3            0             1  \n",
       "4            4             0  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "coverage = pd.read_csv(\"data/spring_petclinic_production_coverage_data.csv\")\n",
    "coverage.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a35e24a7",
   "metadata": {},
   "source": [
    "Enrich data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "62b82095",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>PACKAGE</th>\n",
       "      <th>CLASS</th>\n",
       "      <th>LINE_MISSED</th>\n",
       "      <th>LINE_COVERED</th>\n",
       "      <th>lines</th>\n",
       "      <th>ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic</td>\n",
       "      <td>PetclinicInitializer</td>\n",
       "      <td>0</td>\n",
       "      <td>24</td>\n",
       "      <td>24</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>NamedEntity</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>0.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>Specialty</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>PetType</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>Vets</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       PACKAGE                 CLASS  \\\n",
       "0        org.springframework.samples.petclinic  PetclinicInitializer   \n",
       "1  org.springframework.samples.petclinic.model           NamedEntity   \n",
       "2  org.springframework.samples.petclinic.model             Specialty   \n",
       "3  org.springframework.samples.petclinic.model               PetType   \n",
       "4  org.springframework.samples.petclinic.model                  Vets   \n",
       "\n",
       "   LINE_MISSED  LINE_COVERED  lines  ratio  \n",
       "0            0            24     24    1.0  \n",
       "1            1             4      5    0.8  \n",
       "2            0             1      1    1.0  \n",
       "3            0             1      1    1.0  \n",
       "4            4             0      4    0.0  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "coverage['lines'] = coverage.LINE_COVERED + coverage.LINE_MISSED\n",
    "coverage['ratio'] = coverage.LINE_COVERED / coverage.lines\n",
    "coverage.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "06ac0838",
   "metadata": {},
   "source": [
    "Normalize data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "f1b8cd47",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>PACKAGE</th>\n",
       "      <th>CLASS</th>\n",
       "      <th>LINE_MISSED</th>\n",
       "      <th>LINE_COVERED</th>\n",
       "      <th>lines</th>\n",
       "      <th>ratio</th>\n",
       "      <th>fqn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic</td>\n",
       "      <td>PetclinicInitializer</td>\n",
       "      <td>0</td>\n",
       "      <td>24</td>\n",
       "      <td>24</td>\n",
       "      <td>1.0</td>\n",
       "      <td>org.springframework.samples.petclinic.Petclini...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>NamedEntity</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>0.8</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Na...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>Specialty</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Sp...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>PetType</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>Vets</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>0.0</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Vets</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       PACKAGE                 CLASS  \\\n",
       "0        org.springframework.samples.petclinic  PetclinicInitializer   \n",
       "1  org.springframework.samples.petclinic.model           NamedEntity   \n",
       "2  org.springframework.samples.petclinic.model             Specialty   \n",
       "3  org.springframework.samples.petclinic.model               PetType   \n",
       "4  org.springframework.samples.petclinic.model                  Vets   \n",
       "\n",
       "   LINE_MISSED  LINE_COVERED  lines  ratio  \\\n",
       "0            0            24     24    1.0   \n",
       "1            1             4      5    0.8   \n",
       "2            0             1      1    1.0   \n",
       "3            0             1      1    1.0   \n",
       "4            4             0      4    0.0   \n",
       "\n",
       "                                                 fqn  \n",
       "0  org.springframework.samples.petclinic.Petclini...  \n",
       "1  org.springframework.samples.petclinic.model.Na...  \n",
       "2  org.springframework.samples.petclinic.model.Sp...  \n",
       "3  org.springframework.samples.petclinic.model.Pe...  \n",
       "4   org.springframework.samples.petclinic.model.Vets  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "coverage['fqn'] = coverage[\"PACKAGE\"] + \".\" + coverage[\"CLASS\"]\n",
    "coverage.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7037f1bb",
   "metadata": {},
   "source": [
    "## Import source code data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "997fcabe",
   "metadata": {},
   "source": [
    "Import data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "5e11f9dd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>language</th>\n",
       "      <th>filename</th>\n",
       "      <th>blank</th>\n",
       "      <th>comment</th>\n",
       "      <th>code</th>\n",
       "      <th>github.com/AlDanial/cloc v 1.82  T=0.33 s (75.4 files/s, 4843.0 lines/s)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/vet/Sp...</td>\n",
       "      <td>5</td>\n",
       "      <td>20</td>\n",
       "      <td>9</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/visit/...</td>\n",
       "      <td>6</td>\n",
       "      <td>31</td>\n",
       "      <td>9</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/PetCli...</td>\n",
       "      <td>5</td>\n",
       "      <td>21</td>\n",
       "      <td>9</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/owner/...</td>\n",
       "      <td>4</td>\n",
       "      <td>18</td>\n",
       "      <td>8</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/model/...</td>\n",
       "      <td>1</td>\n",
       "      <td>18</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   language                                           filename  blank  \\\n",
       "20     Java  ./org/springframework/samples/petclinic/vet/Sp...      5   \n",
       "21     Java  ./org/springframework/samples/petclinic/visit/...      6   \n",
       "22     Java  ./org/springframework/samples/petclinic/PetCli...      5   \n",
       "23     Java  ./org/springframework/samples/petclinic/owner/...      4   \n",
       "24     Java  ./org/springframework/samples/petclinic/model/...      1   \n",
       "\n",
       "    comment  code  \\\n",
       "20       20     9   \n",
       "21       31     9   \n",
       "22       21     9   \n",
       "23       18     8   \n",
       "24       18     1   \n",
       "\n",
       "    github.com/AlDanial/cloc v 1.82  T=0.33 s (75.4 files/s, 4843.0 lines/s)  \n",
       "20                                                NaN                         \n",
       "21                                                NaN                         \n",
       "22                                                NaN                         \n",
       "23                                                NaN                         \n",
       "24                                                NaN                         "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cloc = pd.read_csv(\"data/spring_petclinic_cloc.csv\")[:-1].copy()\n",
    "cloc.tail()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5dfdf83",
   "metadata": {},
   "source": [
    "Normalize data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "54b39a23",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>language</th>\n",
       "      <th>filename</th>\n",
       "      <th>blank</th>\n",
       "      <th>comment</th>\n",
       "      <th>code</th>\n",
       "      <th>github.com/AlDanial/cloc v 1.82  T=0.33 s (75.4 files/s, 4843.0 lines/s)</th>\n",
       "      <th>fqn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/owner/...</td>\n",
       "      <td>18</td>\n",
       "      <td>31</td>\n",
       "      <td>96</td>\n",
       "      <td>NaN</td>\n",
       "      <td>org.springframework.samples.petclinic.owner.Ow...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/owner/...</td>\n",
       "      <td>23</td>\n",
       "      <td>33</td>\n",
       "      <td>94</td>\n",
       "      <td>NaN</td>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/owner/...</td>\n",
       "      <td>16</td>\n",
       "      <td>20</td>\n",
       "      <td>77</td>\n",
       "      <td>NaN</td>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/owner/...</td>\n",
       "      <td>19</td>\n",
       "      <td>22</td>\n",
       "      <td>71</td>\n",
       "      <td>NaN</td>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pet</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Java</td>\n",
       "      <td>./org/springframework/samples/petclinic/owner/...</td>\n",
       "      <td>12</td>\n",
       "      <td>31</td>\n",
       "      <td>49</td>\n",
       "      <td>NaN</td>\n",
       "      <td>org.springframework.samples.petclinic.owner.Vi...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  language                                           filename  blank  comment  \\\n",
       "0     Java  ./org/springframework/samples/petclinic/owner/...     18       31   \n",
       "1     Java  ./org/springframework/samples/petclinic/owner/...     23       33   \n",
       "2     Java  ./org/springframework/samples/petclinic/owner/...     16       20   \n",
       "3     Java  ./org/springframework/samples/petclinic/owner/...     19       22   \n",
       "4     Java  ./org/springframework/samples/petclinic/owner/...     12       31   \n",
       "\n",
       "   code  \\\n",
       "0    96   \n",
       "1    94   \n",
       "2    77   \n",
       "3    71   \n",
       "4    49   \n",
       "\n",
       "   github.com/AlDanial/cloc v 1.82  T=0.33 s (75.4 files/s, 4843.0 lines/s)  \\\n",
       "0                                                NaN                          \n",
       "1                                                NaN                          \n",
       "2                                                NaN                          \n",
       "3                                                NaN                          \n",
       "4                                                NaN                          \n",
       "\n",
       "                                                 fqn  \n",
       "0  org.springframework.samples.petclinic.owner.Ow...  \n",
       "1  org.springframework.samples.petclinic.owner.Owner  \n",
       "2  org.springframework.samples.petclinic.owner.Pe...  \n",
       "3    org.springframework.samples.petclinic.owner.Pet  \n",
       "4  org.springframework.samples.petclinic.owner.Vi...  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cloc['fqn'] = cloc['filename'].str.replace(\"./\", \"\", regex=False)\\\n",
    "                              .str.replace(\"/\",\".\", regex=False)\\\n",
    "                              .str.replace(\".java\",\"\", regex=False)\n",
    "cloc.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "efa83efc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>fqn</th>\n",
       "      <th>code</th>\n",
       "      <th>comment</th>\n",
       "      <th>blank</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Ow...</td>\n",
       "      <td>96</td>\n",
       "      <td>31</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "      <td>94</td>\n",
       "      <td>33</td>\n",
       "      <td>23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "      <td>77</td>\n",
       "      <td>20</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pet</td>\n",
       "      <td>71</td>\n",
       "      <td>22</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Vi...</td>\n",
       "      <td>49</td>\n",
       "      <td>31</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 fqn  code  comment  blank\n",
       "0  org.springframework.samples.petclinic.owner.Ow...    96       31     18\n",
       "1  org.springframework.samples.petclinic.owner.Owner    94       33     23\n",
       "2  org.springframework.samples.petclinic.owner.Pe...    77       20     16\n",
       "3    org.springframework.samples.petclinic.owner.Pet    71       22     19\n",
       "4  org.springframework.samples.petclinic.owner.Vi...    49       31     12"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "loc = cloc[['fqn', 'code', 'comment', 'blank']].dropna().copy()\n",
    "loc.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2547501f",
   "metadata": {},
   "source": [
    "# Load data into Neo4J"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "28cd5b24",
   "metadata": {},
   "source": [
    "Esablish connection to Neo4j graph database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "1a5655f3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Graph('http://localhost:7474')"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "graph = Graph(\"http://localhost:7474\", password=\"neo4j\")\n",
    "graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e38f4ae",
   "metadata": {},
   "source": [
    "Clean data from previous run"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "d8ae598a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "(No data)"
      ],
      "text/plain": [
       "(No data)"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "   MATCH (n:JType)\n",
    "   MATCH (m:JMeasure)\n",
    "   DETACH DELETE n, m\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e9c18453",
   "metadata": {},
   "source": [
    "## jdeps"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "128664bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>raw</th>\n",
       "      <th>from</th>\n",
       "      <th>to</th>\n",
       "      <th>type</th>\n",
       "      <th>name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>867</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>java.lang.Class</td>\n",
       "      <td></td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>868</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>java.lang.Object</td>\n",
       "      <td></td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>869</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>java.lang.String</td>\n",
       "      <td></td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>870</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>org.springframework.boot.SpringApplication</td>\n",
       "      <td>not found</td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>871</th>\n",
       "      <td>org.springframework.samples.petclinic.PetCl...</td>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>org.springframework.boot.autoconfigure.SpringB...</td>\n",
       "      <td>not found</td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   raw  \\\n",
       "867     org.springframework.samples.petclinic.PetCl...   \n",
       "868     org.springframework.samples.petclinic.PetCl...   \n",
       "869     org.springframework.samples.petclinic.PetCl...   \n",
       "870     org.springframework.samples.petclinic.PetCl...   \n",
       "871     org.springframework.samples.petclinic.PetCl...   \n",
       "\n",
       "                                                  from  \\\n",
       "867  org.springframework.samples.petclinic.PetClini...   \n",
       "868  org.springframework.samples.petclinic.PetClini...   \n",
       "869  org.springframework.samples.petclinic.PetClini...   \n",
       "870  org.springframework.samples.petclinic.PetClini...   \n",
       "871  org.springframework.samples.petclinic.PetClini...   \n",
       "\n",
       "                                                    to       type  \\\n",
       "867                                    java.lang.Class              \n",
       "868                                   java.lang.Object              \n",
       "869                                   java.lang.String              \n",
       "870         org.springframework.boot.SpringApplication  not found   \n",
       "871  org.springframework.boot.autoconfigure.SpringB...  not found   \n",
       "\n",
       "                     name  \n",
       "867  PetClinicApplication  \n",
       "868  PetClinicApplication  \n",
       "869  PetClinicApplication  \n",
       "870  PetClinicApplication  \n",
       "871  PetClinicApplication  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "petclinic_deps.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "8f0539ea",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t.fqn</th>\n",
       "      <th>t.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "      <td>PetClinicApplication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Ba...</td>\n",
       "      <td>BaseEntity</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Na...</td>\n",
       "      <td>NamedEntity</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Pe...</td>\n",
       "      <td>Person</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "      <td>Owner</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               t.fqn                t.name\n",
       "0  org.springframework.samples.petclinic.PetClini...  PetClinicApplication\n",
       "1  org.springframework.samples.petclinic.model.Ba...            BaseEntity\n",
       "2  org.springframework.samples.petclinic.model.Na...           NamedEntity\n",
       "3  org.springframework.samples.petclinic.model.Pe...                Person\n",
       "4  org.springframework.samples.petclinic.owner.Owner                 Owner"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "    UNWIND {deps_data} as dep\n",
    "    CREATE\n",
    "        (t:JType)\n",
    "    SET\n",
    "        t.fqn = dep.from,\n",
    "        t.name = dep.name\n",
    "    RETURN t.fqn, t.name\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(query, deps_data=petclinic_deps[['from', 'name']].drop_duplicates().to_dict(orient='records')).data()\n",
    "pd.DataFrame(result).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "780e24b4",
   "metadata": {},
   "source": [
    "Create index for `fqn\" for faster queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "8f295674",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "(No data)"
      ],
      "text/plain": [
       "(No data)"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "  CREATE INDEX ON :J(fqn)\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e2e6ee8e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>from.fqn</th>\n",
       "      <th>to.fqn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Na...</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Ba...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Pe...</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Ba...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pet</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Ow...</td>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            from.fqn  \\\n",
       "0  org.springframework.samples.petclinic.model.Na...   \n",
       "1  org.springframework.samples.petclinic.model.Pe...   \n",
       "2  org.springframework.samples.petclinic.owner.Owner   \n",
       "3  org.springframework.samples.petclinic.owner.Owner   \n",
       "4  org.springframework.samples.petclinic.owner.Ow...   \n",
       "\n",
       "                                              to.fqn  \n",
       "0  org.springframework.samples.petclinic.model.Ba...  \n",
       "1  org.springframework.samples.petclinic.model.Ba...  \n",
       "2  org.springframework.samples.petclinic.model.Pe...  \n",
       "3    org.springframework.samples.petclinic.owner.Pet  \n",
       "4  org.springframework.samples.petclinic.owner.Owner  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "    UNWIND {deps_data} as dep\n",
    "    MATCH (from:JType {fqn : dep.from})\n",
    "    MATCH (to:JType {fqn: dep.to})\n",
    "    MERGE (from)-[:DEPENDS_ON]->(to)\n",
    "    RETURN from.fqn, to.fqn\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(query, deps_data=petclinic_deps.to_dict(orient='records')).data()\n",
    "pd.DataFrame(result).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a38bee50",
   "metadata": {},
   "source": [
    "## JaCoCo coverage data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "1f9d2863",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>PACKAGE</th>\n",
       "      <th>CLASS</th>\n",
       "      <th>LINE_MISSED</th>\n",
       "      <th>LINE_COVERED</th>\n",
       "      <th>lines</th>\n",
       "      <th>ratio</th>\n",
       "      <th>fqn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic</td>\n",
       "      <td>PetclinicInitializer</td>\n",
       "      <td>0</td>\n",
       "      <td>24</td>\n",
       "      <td>24</td>\n",
       "      <td>1.0</td>\n",
       "      <td>org.springframework.samples.petclinic.Petclini...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>NamedEntity</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>0.8</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Na...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>Specialty</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Sp...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>PetType</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.model</td>\n",
       "      <td>Vets</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>0.0</td>\n",
       "      <td>org.springframework.samples.petclinic.model.Vets</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       PACKAGE                 CLASS  \\\n",
       "0        org.springframework.samples.petclinic  PetclinicInitializer   \n",
       "1  org.springframework.samples.petclinic.model           NamedEntity   \n",
       "2  org.springframework.samples.petclinic.model             Specialty   \n",
       "3  org.springframework.samples.petclinic.model               PetType   \n",
       "4  org.springframework.samples.petclinic.model                  Vets   \n",
       "\n",
       "   LINE_MISSED  LINE_COVERED  lines  ratio  \\\n",
       "0            0            24     24    1.0   \n",
       "1            1             4      5    0.8   \n",
       "2            0             1      1    1.0   \n",
       "3            0             1      1    1.0   \n",
       "4            4             0      4    0.0   \n",
       "\n",
       "                                                 fqn  \n",
       "0  org.springframework.samples.petclinic.Petclini...  \n",
       "1  org.springframework.samples.petclinic.model.Na...  \n",
       "2  org.springframework.samples.petclinic.model.Sp...  \n",
       "3  org.springframework.samples.petclinic.model.Pe...  \n",
       "4   org.springframework.samples.petclinic.model.Vets  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "coverage.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "154c82b4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>fqn</th>\n",
       "      <th>ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Na...</td>\n",
       "      <td>0.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Ba...</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Pe...</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 fqn  ratio\n",
       "0  org.springframework.samples.petclinic.model.Na...    0.8\n",
       "1  org.springframework.samples.petclinic.model.Ba...    1.0\n",
       "2  org.springframework.samples.petclinic.model.Pe...    1.0"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "    UNWIND {coverage_data} as coverage\n",
    "    MATCH (t:JType {fqn : coverage.fqn})\n",
    "    MERGE (t)-[:HAS_JMEASURE]->(m)\n",
    "    SET \n",
    "        m:JMeasure:JCoverage,\n",
    "        m.ratio = coverage.ratio\n",
    "    RETURN t.fqn as fqn, m.ratio as ratio\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(query, coverage_data=coverage.to_dict(orient='records')).data()\n",
    "pd.DataFrame(result).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "90c75882",
   "metadata": {},
   "source": [
    "## cloc data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "43cf74be",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>fqn</th>\n",
       "      <th>code</th>\n",
       "      <th>comment</th>\n",
       "      <th>blank</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Ow...</td>\n",
       "      <td>96</td>\n",
       "      <td>31</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "      <td>94</td>\n",
       "      <td>33</td>\n",
       "      <td>23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "      <td>77</td>\n",
       "      <td>20</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pet</td>\n",
       "      <td>71</td>\n",
       "      <td>22</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Vi...</td>\n",
       "      <td>49</td>\n",
       "      <td>31</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 fqn  code  comment  blank\n",
       "0  org.springframework.samples.petclinic.owner.Ow...    96       31     18\n",
       "1  org.springframework.samples.petclinic.owner.Owner    94       33     23\n",
       "2  org.springframework.samples.petclinic.owner.Pe...    77       20     16\n",
       "3    org.springframework.samples.petclinic.owner.Pet    71       22     19\n",
       "4  org.springframework.samples.petclinic.owner.Vi...    49       31     12"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "loc.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "1b795fc7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t.fqn</th>\n",
       "      <th>t.name</th>\n",
       "      <th>t.lines</th>\n",
       "      <th>t.comments</th>\n",
       "      <th>t.blanks</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Ow...</td>\n",
       "      <td>OwnerController</td>\n",
       "      <td>96</td>\n",
       "      <td>31</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "      <td>Owner</td>\n",
       "      <td>94</td>\n",
       "      <td>33</td>\n",
       "      <td>23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "      <td>PetController</td>\n",
       "      <td>77</td>\n",
       "      <td>20</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pet</td>\n",
       "      <td>Pet</td>\n",
       "      <td>71</td>\n",
       "      <td>22</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Vi...</td>\n",
       "      <td>VisitController</td>\n",
       "      <td>49</td>\n",
       "      <td>31</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               t.fqn           t.name  \\\n",
       "0  org.springframework.samples.petclinic.owner.Ow...  OwnerController   \n",
       "1  org.springframework.samples.petclinic.owner.Owner            Owner   \n",
       "2  org.springframework.samples.petclinic.owner.Pe...    PetController   \n",
       "3    org.springframework.samples.petclinic.owner.Pet              Pet   \n",
       "4  org.springframework.samples.petclinic.owner.Vi...  VisitController   \n",
       "\n",
       "   t.lines  t.comments  t.blanks  \n",
       "0       96          31        18  \n",
       "1       94          33        23  \n",
       "2       77          20        16  \n",
       "3       71          22        19  \n",
       "4       49          31        12  "
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "    UNWIND {cloc_data} as loc\n",
    "    MATCH (t:JType {fqn : loc.fqn})\n",
    "    SET\n",
    "        t.lines = loc.code,\n",
    "        t.comments = loc.comment,\n",
    "        t.blanks = loc.blank\n",
    "    RETURN t.fqn, t.name, t.lines, t.comments, t.blanks\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(query, cloc_data=loc.to_dict(orient='records')).data()\n",
    "pd.DataFrame(result).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c1001337",
   "metadata": {},
   "source": [
    "# Check data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f11de2d4",
   "metadata": {},
   "source": [
    "## Validate Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "5ff08ede",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.fqn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Ow...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pet</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Vi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>org.springframework.samples.petclinic.system.C...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>org.springframework.samples.petclinic.system.C...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>org.springframework.samples.petclinic.system.W...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>org.springframework.samples.petclinic.vet.Spec...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>org.springframework.samples.petclinic.vet.Vet</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>org.springframework.samples.petclinic.vet.VetC...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>org.springframework.samples.petclinic.vet.VetR...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>org.springframework.samples.petclinic.vet.Vets</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>org.springframework.samples.petclinic.visit.Visit</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>org.springframework.samples.petclinic.visit.Vi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>org.springframework.samples.petclinic.PetClini...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Ba...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Na...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Pe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Owner</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>org.springframework.samples.petclinic.owner.Ow...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                n.fqn\n",
       "0   org.springframework.samples.petclinic.owner.Ow...\n",
       "1     org.springframework.samples.petclinic.owner.Pet\n",
       "2   org.springframework.samples.petclinic.owner.Pe...\n",
       "3   org.springframework.samples.petclinic.owner.Pe...\n",
       "4   org.springframework.samples.petclinic.owner.Pe...\n",
       "5   org.springframework.samples.petclinic.owner.Pe...\n",
       "6   org.springframework.samples.petclinic.owner.Pe...\n",
       "7   org.springframework.samples.petclinic.owner.Vi...\n",
       "8   org.springframework.samples.petclinic.system.C...\n",
       "9   org.springframework.samples.petclinic.system.C...\n",
       "10  org.springframework.samples.petclinic.system.W...\n",
       "11  org.springframework.samples.petclinic.vet.Spec...\n",
       "12      org.springframework.samples.petclinic.vet.Vet\n",
       "13  org.springframework.samples.petclinic.vet.VetC...\n",
       "14  org.springframework.samples.petclinic.vet.VetR...\n",
       "15     org.springframework.samples.petclinic.vet.Vets\n",
       "16  org.springframework.samples.petclinic.visit.Visit\n",
       "17  org.springframework.samples.petclinic.visit.Vi...\n",
       "18  org.springframework.samples.petclinic.PetClini...\n",
       "19  org.springframework.samples.petclinic.model.Ba...\n",
       "20  org.springframework.samples.petclinic.model.Na...\n",
       "21  org.springframework.samples.petclinic.model.Pe...\n",
       "22  org.springframework.samples.petclinic.owner.Owner\n",
       "23  org.springframework.samples.petclinic.owner.Ow..."
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "   MATCH (n:JType)\n",
    "   RETURN n.fqn\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(query).data()\n",
    "pd.DataFrame(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "7750a7cb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.fqn</th>\n",
       "      <th>n.lines</th>\n",
       "      <th>m.ratio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Na...</td>\n",
       "      <td>18</td>\n",
       "      <td>0.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Ba...</td>\n",
       "      <td>21</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>org.springframework.samples.petclinic.model.Pe...</td>\n",
       "      <td>25</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               n.fqn  n.lines  m.ratio\n",
       "0  org.springframework.samples.petclinic.model.Na...       18      0.8\n",
       "1  org.springframework.samples.petclinic.model.Ba...       21      1.0\n",
       "2  org.springframework.samples.petclinic.model.Pe...       25      1.0"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "   MATCH (n:JType)-[:HAS_JMEASURE]->(m:JMeasure)\n",
    "   RETURN n.fqn, n.lines, m.ratio\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(query).data()\n",
    "pd.DataFrame(result)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
