{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# jQAssistant Code Smell Cheat Sheet\n",
    "Hints for local use:\n",
    "\n",
    "* Local install: https://github.com/JavaOnAutobahn/spring-petclinic\n",
    "* jQAssistant documentation (Java): https://jqassistant.github.io/jqassistant/doc/1.11.1/manual/#java-plugin\n",
    " "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setup Neo4j graph database connection\n",
    "Load Cypher Extension for Jupyter"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "env: NEO4J_URL=http://neo4j:neo4j@localhost:7474/db/data\n"
     ]
    }
   ],
   "source": [
    "%reload_ext cypher\n",
    "%env NEO4J_URL=http://neo4j:neo4j@localhost:7474/db/data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Getting familiar with the Cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List five classes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>t.name</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>BaseEntity</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>NamedEntity</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Owner</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Person</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Pet</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['BaseEntity'], ['NamedEntity'], ['Owner'], ['Person'], ['Pet']]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (t:Class)\n",
    "RETURN t.name\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List classes and their methods"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>t.name</th>\n",
       "            <th>m.name</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>BaseEntity</td>\n",
       "            <td>setId</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>BaseEntity</td>\n",
       "            <td>getId</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>BaseEntity</td>\n",
       "            <td>isNew</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>BaseEntity</td>\n",
       "            <td>&lt;init&gt;</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>NamedEntity</td>\n",
       "            <td>setName</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['BaseEntity', 'setId'],\n",
       " ['BaseEntity', 'getId'],\n",
       " ['BaseEntity', 'isNew'],\n",
       " ['BaseEntity', '<init>'],\n",
       " ['NamedEntity', 'setName']]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (t:Class)-[:DECLARES]->(m:Method)\n",
    "RETURN t.name, m.name\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List classes with the most methods"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>type</th>\n",
       "            <th>methods</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Owner</td>\n",
       "            <td>21</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>16</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.web.OwnerControllerTests</td>\n",
       "            <td>13</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.service.AbstractClinicServiceTests</td>\n",
       "            <td>12</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.service.ClinicServiceImpl</td>\n",
       "            <td>11</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Vet</td>\n",
       "            <td>11</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.repository.jdbc.JdbcPet</td>\n",
       "            <td>10</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Visit</td>\n",
       "            <td>10</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.web.OwnerController</td>\n",
       "            <td>9</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.service.ClinicService</td>\n",
       "            <td>9</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['org.springframework.samples.petclinic.model.Owner', 21],\n",
       " ['org.springframework.samples.petclinic.model.Pet', 16],\n",
       " ['org.springframework.samples.petclinic.web.OwnerControllerTests', 13],\n",
       " ['org.springframework.samples.petclinic.service.AbstractClinicServiceTests',\n",
       "  12],\n",
       " ['org.springframework.samples.petclinic.service.ClinicServiceImpl', 11],\n",
       " ['org.springframework.samples.petclinic.model.Vet', 11],\n",
       " ['org.springframework.samples.petclinic.repository.jdbc.JdbcPet', 10],\n",
       " ['org.springframework.samples.petclinic.model.Visit', 10],\n",
       " ['org.springframework.samples.petclinic.web.OwnerController', 9],\n",
       " ['org.springframework.samples.petclinic.service.ClinicService', 9]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH \n",
    "  (t:Type)-[:DECLARES]->(m:Method)\n",
    "RETURN t.fqn as type, COUNT(m) as methods\n",
    "ORDER BY methods DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Methods of a specific class"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "16 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>type</th>\n",
       "            <th>Methods</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>void setName(java.lang.String)</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>void setVisitsInternal(java.util.Set)</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>java.util.List getVisits()</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>java.lang.Integer getId()</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>boolean isNew()</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>void setOwner(org.springframework.samples.petclinic.model.Owner)</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>java.util.Set getVisitsInternal()</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>org.springframework.samples.petclinic.model.Owner getOwner()</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>void setType(org.springframework.samples.petclinic.repository.PetType)</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>void setBirthDate(org.joda.time.LocalDate)</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>void setId(java.lang.Integer)</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>java.lang.String getName()</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>org.springframework.samples.petclinic.repository.PetType getType()</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>org.joda.time.LocalDate getBirthDate()</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>void addVisit(org.springframework.samples.petclinic.model.Visit)</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Pet</td>\n",
       "            <td>void &lt;init&gt;()</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['org.springframework.samples.petclinic.model.Pet',\n",
       "  'void setName(java.lang.String)'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'void setVisitsInternal(java.util.Set)'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'java.util.List getVisits()'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'java.lang.Integer getId()'],\n",
       " ['org.springframework.samples.petclinic.model.Pet', 'boolean isNew()'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'void setOwner(org.springframework.samples.petclinic.model.Owner)'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'java.util.Set getVisitsInternal()'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'org.springframework.samples.petclinic.model.Owner getOwner()'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'void setType(org.springframework.samples.petclinic.repository.PetType)'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'void setBirthDate(org.joda.time.LocalDate)'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'void setId(java.lang.Integer)'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'java.lang.String getName()'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'org.springframework.samples.petclinic.repository.PetType getType()'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'org.joda.time.LocalDate getBirthDate()'],\n",
       " ['org.springframework.samples.petclinic.model.Pet',\n",
       "  'void addVisit(org.springframework.samples.petclinic.model.Visit)'],\n",
       " ['org.springframework.samples.petclinic.model.Pet', 'void <init>()']]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH \n",
    "  (t:Type {name: \"Pet\"})-[:DECLARES]->(m:Method)\n",
    "RETURN t.fqn as type, m.signature as Methods"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List biggest classes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>type</th>\n",
       "            <th>LOC</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.web.OwnerControllerTests</td>\n",
       "            <td>95</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.service.AbstractClinicServiceTests</td>\n",
       "            <td>91</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.web.PetControllerTests</td>\n",
       "            <td>52</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.repository.jdbc.JdbcOwnerRepositoryImpl</td>\n",
       "            <td>43</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.web.OwnerController</td>\n",
       "            <td>40</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.model.Owner</td>\n",
       "            <td>40</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.repository.jdbc.JdbcPetRepositoryImpl</td>\n",
       "            <td>33</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.web.PetController</td>\n",
       "            <td>32</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.web.VetControllerTests</td>\n",
       "            <td>31</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>org.springframework.samples.petclinic.repository.jdbc.JdbcVisitRepositoryImpl</td>\n",
       "            <td>26</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['org.springframework.samples.petclinic.web.OwnerControllerTests', 95],\n",
       " ['org.springframework.samples.petclinic.service.AbstractClinicServiceTests',\n",
       "  91],\n",
       " ['org.springframework.samples.petclinic.web.PetControllerTests', 52],\n",
       " ['org.springframework.samples.petclinic.repository.jdbc.JdbcOwnerRepositoryImpl',\n",
       "  43],\n",
       " ['org.springframework.samples.petclinic.web.OwnerController', 40],\n",
       " ['org.springframework.samples.petclinic.model.Owner', 40],\n",
       " ['org.springframework.samples.petclinic.repository.jdbc.JdbcPetRepositoryImpl',\n",
       "  33],\n",
       " ['org.springframework.samples.petclinic.web.PetController', 32],\n",
       " ['org.springframework.samples.petclinic.web.VetControllerTests', 31],\n",
       " ['org.springframework.samples.petclinic.repository.jdbc.JdbcVisitRepositoryImpl',\n",
       "  26]]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH \n",
    "  (t:Type)-[:DECLARES]->(m:Method)\n",
    "RETURN t.fqn as type, SUM(m.effectiveLineCount) as LOC\n",
    "ORDER BY LOC DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Getting familiar with the dataset"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Existing labels `()`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Labels</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>[&#x27;File&#x27;, &#x27;Project&#x27;, &#x27;Maven&#x27;, &#x27;Container&#x27;, &#x27;Directory&#x27;, &#x27;Artifact&#x27;, &#x27;Java&#x27;, &#x27;Main&#x27;, &#x27;Xml&#x27;, &#x27;Element&#x27;, &#x27;Attribute&#x27;, &#x27;Package&#x27;, &#x27;Root&#x27;, &#x27;Value&#x27;, &#x27;Property&#x27;, &#x27;Properties&#x27;, &#x27;Document&#x27;, &#x27;Namespace&#x27;, &#x27;Type&#x27;, &#x27;Annotation&#x27;, &#x27;Enum&#x27;, &#x27;Field&#x27;, &#x27;Member&#x27;, &#x27;Method&#x27;, &#x27;Class&#x27;, &#x27;Layer&#x27;, &#x27;Constructor&#x27;, &#x27;Parameter&#x27;, &#x27;Jpa&#x27;, &#x27;Entity&#x27;, &#x27;Primitive&#x27;, &#x27;Array&#x27;, &#x27;Interface&#x27;, &#x27;Repository&#x27;, &#x27;Spring&#x27;, &#x27;Component&#x27;, &#x27;Service&#x27;, &#x27;Controller&#x27;, &#x27;ManagedResource&#x27;, &#x27;ManagedAttribute&#x27;, &#x27;ManagedOperation&#x27;, &#x27;Concept&#x27;, &#x27;Test&#x27;, &#x27;Junit4&#x27;, &#x27;AssertJ&#x27;, &#x27;Assert&#x27;, &#x27;Text&#x27;, &#x27;Pom&#x27;, &#x27;Profile&#x27;, &#x27;Plugin&#x27;, &#x27;Configuration&#x27;, &#x27;ExecutionGoal&#x27;, &#x27;PluginExecution&#x27;, &#x27;Business&#x27;, &#x27;Subdomain&#x27;, &#x27;Dependent&#x27;, &#x27;TestReport&#x27;, &#x27;JUnit&#x27;, &#x27;BoundedContext&#x27;, &#x27;TechnicalAspect&#x27;]</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['File',\n",
       "   'Project',\n",
       "   'Maven',\n",
       "   'Container',\n",
       "   'Directory',\n",
       "   'Artifact',\n",
       "   'Java',\n",
       "   'Main',\n",
       "   'Xml',\n",
       "   'Element',\n",
       "   'Attribute',\n",
       "   'Package',\n",
       "   'Root',\n",
       "   'Value',\n",
       "   'Property',\n",
       "   'Properties',\n",
       "   'Document',\n",
       "   'Namespace',\n",
       "   'Type',\n",
       "   'Annotation',\n",
       "   'Enum',\n",
       "   'Field',\n",
       "   'Member',\n",
       "   'Method',\n",
       "   'Class',\n",
       "   'Layer',\n",
       "   'Constructor',\n",
       "   'Parameter',\n",
       "   'Jpa',\n",
       "   'Entity',\n",
       "   'Primitive',\n",
       "   'Array',\n",
       "   'Interface',\n",
       "   'Repository',\n",
       "   'Spring',\n",
       "   'Component',\n",
       "   'Service',\n",
       "   'Controller',\n",
       "   'ManagedResource',\n",
       "   'ManagedAttribute',\n",
       "   'ManagedOperation',\n",
       "   'Concept',\n",
       "   'Test',\n",
       "   'Junit4',\n",
       "   'AssertJ',\n",
       "   'Assert',\n",
       "   'Text',\n",
       "   'Pom',\n",
       "   'Profile',\n",
       "   'Plugin',\n",
       "   'Configuration',\n",
       "   'ExecutionGoal',\n",
       "   'PluginExecution',\n",
       "   'Business',\n",
       "   'Subdomain',\n",
       "   'Dependent',\n",
       "   'TestReport',\n",
       "   'JUnit',\n",
       "   'BoundedContext',\n",
       "   'TechnicalAspect']]]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (n)\n",
    "WITH DISTINCT labels(n) as labels\n",
    "UNWIND labels as label\n",
    "RETURN COLLECT(DISTINCT(label)) as Labels"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Existing properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Properties</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>[&#x27;groupId&#x27;, &#x27;version&#x27;, &#x27;artifactId&#x27;, &#x27;fqn&#x27;, &#x27;name&#x27;, &#x27;packaging&#x27;, &#x27;group&#x27;, &#x27;type&#x27;, &#x27;fileName&#x27;, &#x27;value&#x27;, &#x27;characterEncodingScheme&#x27;, &#x27;xmlVersion&#x27;, &#x27;standalone&#x27;, &#x27;xmlWellFormed&#x27;, &#x27;uri&#x27;, &#x27;prefix&#x27;, &#x27;md5&#x27;, &#x27;sourceFileName&#x27;, &#x27;visibility&#x27;, &#x27;byteCodeVersion&#x27;, &#x27;valid&#x27;, &#x27;signature&#x27;, &#x27;cyclomaticComplexity&#x27;, &#x27;abstract&#x27;, &#x27;lastMethodLineNumber&#x27;, &#x27;transient&#x27;, &#x27;volatile&#x27;, &#x27;firstLineNumber&#x27;, &#x27;lastLineNumber&#x27;, &#x27;effectiveLineCount&#x27;, &#x27;index&#x27;, &#x27;synthetic&#x27;, &#x27;static&#x27;, &#x27;final&#x27;, &#x27;id&#x27;, &#x27;status&#x27;, &#x27;inherited&#x27;, &#x27;phase&#x27;, &#x27;releasesChecksumPolicy&#x27;, &#x27;releasesEnabled&#x27;, &#x27;releasesUpdatePolicy&#x27;, &#x27;snapshotsChecksumPolicy&#x27;, &#x27;snapshotsEnabled&#x27;, &#x27;snapshotsUpdatePolicy&#x27;, &#x27;layout&#x27;, &#x27;url&#x27;]</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['groupId',\n",
       "   'version',\n",
       "   'artifactId',\n",
       "   'fqn',\n",
       "   'name',\n",
       "   'packaging',\n",
       "   'group',\n",
       "   'type',\n",
       "   'fileName',\n",
       "   'value',\n",
       "   'characterEncodingScheme',\n",
       "   'xmlVersion',\n",
       "   'standalone',\n",
       "   'xmlWellFormed',\n",
       "   'uri',\n",
       "   'prefix',\n",
       "   'md5',\n",
       "   'sourceFileName',\n",
       "   'visibility',\n",
       "   'byteCodeVersion',\n",
       "   'valid',\n",
       "   'signature',\n",
       "   'cyclomaticComplexity',\n",
       "   'abstract',\n",
       "   'lastMethodLineNumber',\n",
       "   'transient',\n",
       "   'volatile',\n",
       "   'firstLineNumber',\n",
       "   'lastLineNumber',\n",
       "   'effectiveLineCount',\n",
       "   'index',\n",
       "   'synthetic',\n",
       "   'static',\n",
       "   'final',\n",
       "   'id',\n",
       "   'status',\n",
       "   'inherited',\n",
       "   'phase',\n",
       "   'releasesChecksumPolicy',\n",
       "   'releasesEnabled',\n",
       "   'releasesUpdatePolicy',\n",
       "   'snapshotsChecksumPolicy',\n",
       "   'snapshotsEnabled',\n",
       "   'snapshotsUpdatePolicy',\n",
       "   'layout',\n",
       "   'url']]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (n)\n",
    "WITH DISTINCT keys(n) as keys \n",
    "UNWIND keys as key\n",
    "RETURN COLLECT(DISTINCT(key)) as Properties"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Existing relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>RelationshipTypes</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>[&#x27;CONTAINS&#x27;, &#x27;HAS_EFFECTIVE_MODEL&#x27;, &#x27;HAS_MODEL&#x27;, &#x27;CREATES&#x27;, &#x27;DECLARES_DEPENDENCY&#x27;, &#x27;DEPENDS_ON&#x27;, &#x27;MANAGES_DEPENDENCY&#x27;, &#x27;REQUIRES&#x27;, &#x27;DESCRIBES&#x27;, &#x27;HAS_ATTRIBUTE&#x27;, &#x27;OF_NAMESPACE&#x27;, &#x27;HAS_SIBLING&#x27;, &#x27;HAS_ELEMENT&#x27;, &#x27;HAS_LAST_CHILD&#x27;, &#x27;HAS_FIRST_CHILD&#x27;, &#x27;DECLARES_NAMESPACE&#x27;, &#x27;HAS_ROOT_ELEMENT&#x27;, &#x27;HAS&#x27;, &#x27;IS_A&#x27;, &#x27;BELONGS_TO&#x27;, &#x27;IMPLEMENTS&#x27;, &#x27;DECLARES&#x27;, &#x27;EXTENDS&#x27;, &#x27;ANNOTATED_BY&#x27;, &#x27;OF_TYPE&#x27;, &#x27;RETURNS&#x27;, &#x27;IS&#x27;, &#x27;DEFINES_DEPENDENCY&#x27;, &#x27;READS&#x27;, &#x27;WRITES&#x27;, &#x27;INVOKES&#x27;, &#x27;THROWS&#x27;, &#x27;USES&#x27;, &#x27;HAS_TEXT&#x27;, &#x27;HAS_PROFILE&#x27;, &#x27;USES_PLUGIN&#x27;, &#x27;HAS_PROPERTY&#x27;, &#x27;IS_ARTIFACT&#x27;, &#x27;HAS_CONFIGURATION&#x27;, &#x27;HAS_EXECUTION&#x27;, &#x27;HAS_GOAL&#x27;, &#x27;MANAGES_PLUGIN&#x27;, &#x27;HAS_REPOSITORY&#x27;]</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['CONTAINS',\n",
       "   'HAS_EFFECTIVE_MODEL',\n",
       "   'HAS_MODEL',\n",
       "   'CREATES',\n",
       "   'DECLARES_DEPENDENCY',\n",
       "   'DEPENDS_ON',\n",
       "   'MANAGES_DEPENDENCY',\n",
       "   'REQUIRES',\n",
       "   'DESCRIBES',\n",
       "   'HAS_ATTRIBUTE',\n",
       "   'OF_NAMESPACE',\n",
       "   'HAS_SIBLING',\n",
       "   'HAS_ELEMENT',\n",
       "   'HAS_LAST_CHILD',\n",
       "   'HAS_FIRST_CHILD',\n",
       "   'DECLARES_NAMESPACE',\n",
       "   'HAS_ROOT_ELEMENT',\n",
       "   'HAS',\n",
       "   'IS_A',\n",
       "   'BELONGS_TO',\n",
       "   'IMPLEMENTS',\n",
       "   'DECLARES',\n",
       "   'EXTENDS',\n",
       "   'ANNOTATED_BY',\n",
       "   'OF_TYPE',\n",
       "   'RETURNS',\n",
       "   'IS',\n",
       "   'DEFINES_DEPENDENCY',\n",
       "   'READS',\n",
       "   'WRITES',\n",
       "   'INVOKES',\n",
       "   'THROWS',\n",
       "   'USES',\n",
       "   'HAS_TEXT',\n",
       "   'HAS_PROFILE',\n",
       "   'USES_PLUGIN',\n",
       "   'HAS_PROPERTY',\n",
       "   'IS_ARTIFACT',\n",
       "   'HAS_CONFIGURATION',\n",
       "   'HAS_EXECUTION',\n",
       "   'HAS_GOAL',\n",
       "   'MANAGES_PLUGIN',\n",
       "   'HAS_REPOSITORY']]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH ()-[r]-()\n",
    "WITH DISTINCT type(r) as rels_type\n",
    "RETURN COLLECT(DISTINCT(rels_type)) as RelationshipTypes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Elements of types in Java"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Java type node properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Properties</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>abstract</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>byteCodeVersion</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>fileName</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>fqn</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>lastMethodLineNumber</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>md5</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>name</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>sourceFileName</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>synthetic</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>valid</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>visibility</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['abstract'],\n",
       " ['byteCodeVersion'],\n",
       " ['fileName'],\n",
       " ['fqn'],\n",
       " ['lastMethodLineNumber'],\n",
       " ['md5'],\n",
       " ['name'],\n",
       " ['sourceFileName'],\n",
       " ['synthetic'],\n",
       " ['valid'],\n",
       " ['visibility']]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (n:Type:Java)\n",
    "WITH DISTINCT keys(n) as keys \n",
    "UNWIND keys as key\n",
    "RETURN DISTINCT key as Properties\n",
    "ORDER BY Properties"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Java type node relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>RelationshipTypes</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>IS_A</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>BELONGS_TO</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>ANNOTATED_BY</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>REQUIRES</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>THROWS</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IS</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['IS_A'],\n",
       " ['BELONGS_TO'],\n",
       " ['CONTAINS'],\n",
       " ['IMPLEMENTS'],\n",
       " ['DECLARES'],\n",
       " ['DEPENDS_ON'],\n",
       " ['EXTENDS'],\n",
       " ['ANNOTATED_BY'],\n",
       " ['OF_TYPE'],\n",
       " ['RETURNS'],\n",
       " ['REQUIRES'],\n",
       " ['THROWS'],\n",
       " ['USES'],\n",
       " ['IS']]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (:Type:Java)-[r]-()\n",
    "WITH DISTINCT type(r) as rels_type \n",
    "RETURN DISTINCT(rels_type) as RelationshipTypes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Java type neighbour nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Labels</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>[&#x27;Business&#x27;, &#x27;TechnicalAspect&#x27;, &#x27;Subdomain&#x27;, &#x27;File&#x27;, &#x27;Artifact&#x27;, &#x27;Maven&#x27;, &#x27;Container&#x27;, &#x27;Directory&#x27;, &#x27;Java&#x27;, &#x27;Main&#x27;, &#x27;Package&#x27;, &#x27;Type&#x27;, &#x27;Member&#x27;, &#x27;Method&#x27;, &#x27;Value&#x27;, &#x27;Annotation&#x27;, &#x27;Class&#x27;, &#x27;Spring&#x27;, &#x27;Component&#x27;, &#x27;Controller&#x27;, &#x27;Repository&#x27;, &#x27;Interface&#x27;, &#x27;ManagedResource&#x27;, &#x27;Service&#x27;, &#x27;Parameter&#x27;, &#x27;Constructor&#x27;, &#x27;Field&#x27;, &#x27;Enum&#x27;, &#x27;Jpa&#x27;, &#x27;Entity&#x27;, &#x27;Layer&#x27;, &#x27;Primitive&#x27;, &#x27;Test&#x27;, &#x27;Junit4&#x27;, &#x27;ManagedAttribute&#x27;, &#x27;ManagedOperation&#x27;, &#x27;BoundedContext&#x27;, &#x27;Root&#x27;, &#x27;AssertJ&#x27;, &#x27;Assert&#x27;]</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['Business',\n",
       "   'TechnicalAspect',\n",
       "   'Subdomain',\n",
       "   'File',\n",
       "   'Artifact',\n",
       "   'Maven',\n",
       "   'Container',\n",
       "   'Directory',\n",
       "   'Java',\n",
       "   'Main',\n",
       "   'Package',\n",
       "   'Type',\n",
       "   'Member',\n",
       "   'Method',\n",
       "   'Value',\n",
       "   'Annotation',\n",
       "   'Class',\n",
       "   'Spring',\n",
       "   'Component',\n",
       "   'Controller',\n",
       "   'Repository',\n",
       "   'Interface',\n",
       "   'ManagedResource',\n",
       "   'Service',\n",
       "   'Parameter',\n",
       "   'Constructor',\n",
       "   'Field',\n",
       "   'Enum',\n",
       "   'Jpa',\n",
       "   'Entity',\n",
       "   'Layer',\n",
       "   'Primitive',\n",
       "   'Test',\n",
       "   'Junit4',\n",
       "   'ManagedAttribute',\n",
       "   'ManagedOperation',\n",
       "   'BoundedContext',\n",
       "   'Root',\n",
       "   'AssertJ',\n",
       "   'Assert']]]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (:Type:Java)-[]-(n)\n",
    "WITH DISTINCT labels(n) as labels\n",
    "UNWIND labels as label\n",
    "RETURN COLLECT(DISTINCT(label)) as Labels"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Java type neighbour relationships with nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "114 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Relationship</th>\n",
       "            <th>Nodes</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>ANNOTATED_BY</td>\n",
       "            <td>Value</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>ANNOTATED_BY</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>ANNOTATED_BY</td>\n",
       "            <td>Annotation</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>BELONGS_TO</td>\n",
       "            <td>Business</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>BELONGS_TO</td>\n",
       "            <td>Subdomain</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>BELONGS_TO</td>\n",
       "            <td>BoundedContext</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>File</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Artifact</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Maven</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Container</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Directory</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Main</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Package</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Layer</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>CONTAINS</td>\n",
       "            <td>Root</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Member</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Method</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Constructor</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Field</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>File</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Type</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Repository</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Class</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Spring</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Component</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>ManagedAttribute</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>ManagedOperation</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Test</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Junit4</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>AssertJ</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "            <td>Assert</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>File</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Type</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Class</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Spring</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Component</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Controller</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Repository</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Interface</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>ManagedResource</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Annotation</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Service</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Jpa</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>DEPENDS_ON</td>\n",
       "            <td>Entity</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>File</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Type</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Class</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Spring</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Component</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Controller</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Interface</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Repository</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Annotation</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Service</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>ManagedResource</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Jpa</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>EXTENDS</td>\n",
       "            <td>Entity</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>File</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Type</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Annotation</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Interface</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Repository</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Class</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Spring</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Component</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IMPLEMENTS</td>\n",
       "            <td>Service</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IS</td>\n",
       "            <td>Value</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IS</td>\n",
       "            <td>Class</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IS_A</td>\n",
       "            <td>Business</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>IS_A</td>\n",
       "            <td>TechnicalAspect</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "            <td>Parameter</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "            <td>Value</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "            <td>Annotation</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "            <td>Enum</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "            <td>Primitive</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "            <td>Field</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OF_TYPE</td>\n",
       "            <td>Member</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>REQUIRES</td>\n",
       "            <td>File</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>REQUIRES</td>\n",
       "            <td>Artifact</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>REQUIRES</td>\n",
       "            <td>Maven</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>REQUIRES</td>\n",
       "            <td>Container</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>REQUIRES</td>\n",
       "            <td>Directory</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>REQUIRES</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>REQUIRES</td>\n",
       "            <td>Main</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>Member</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>Method</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>Test</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>Junit4</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>Constructor</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>Spring</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>ManagedAttribute</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "            <td>ManagedOperation</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>THROWS</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>THROWS</td>\n",
       "            <td>Member</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>THROWS</td>\n",
       "            <td>Method</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>THROWS</td>\n",
       "            <td>Test</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>THROWS</td>\n",
       "            <td>Junit4</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>File</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Type</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Repository</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Java</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Class</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Spring</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Component</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Service</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Interface</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>USES</td>\n",
       "            <td>Controller</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['ANNOTATED_BY', 'Value'],\n",
       " ['ANNOTATED_BY', 'Java'],\n",
       " ['ANNOTATED_BY', 'Annotation'],\n",
       " ['BELONGS_TO', 'Business'],\n",
       " ['BELONGS_TO', 'Subdomain'],\n",
       " ['BELONGS_TO', 'BoundedContext'],\n",
       " ['CONTAINS', 'File'],\n",
       " ['CONTAINS', 'Artifact'],\n",
       " ['CONTAINS', 'Maven'],\n",
       " ['CONTAINS', 'Container'],\n",
       " ['CONTAINS', 'Directory'],\n",
       " ['CONTAINS', 'Java'],\n",
       " ['CONTAINS', 'Main'],\n",
       " ['CONTAINS', 'Package'],\n",
       " ['CONTAINS', 'Layer'],\n",
       " ['CONTAINS', 'Root'],\n",
       " ['DECLARES', 'Java'],\n",
       " ['DECLARES', 'Member'],\n",
       " ['DECLARES', 'Method'],\n",
       " ['DECLARES', 'Constructor'],\n",
       " ['DECLARES', 'Field'],\n",
       " ['DECLARES', 'File'],\n",
       " ['DECLARES', 'Type'],\n",
       " ['DECLARES', 'Repository'],\n",
       " ['DECLARES', 'Class'],\n",
       " ['DECLARES', 'Spring'],\n",
       " ['DECLARES', 'Component'],\n",
       " ['DECLARES', 'ManagedAttribute'],\n",
       " ['DECLARES', 'ManagedOperation'],\n",
       " ['DECLARES', 'Test'],\n",
       " ['DECLARES', 'Junit4'],\n",
       " ['DECLARES', 'AssertJ'],\n",
       " ['DECLARES', 'Assert'],\n",
       " ['DEPENDS_ON', 'File'],\n",
       " ['DEPENDS_ON', 'Type'],\n",
       " ['DEPENDS_ON', 'Java'],\n",
       " ['DEPENDS_ON', 'Class'],\n",
       " ['DEPENDS_ON', 'Spring'],\n",
       " ['DEPENDS_ON', 'Component'],\n",
       " ['DEPENDS_ON', 'Controller'],\n",
       " ['DEPENDS_ON', 'Repository'],\n",
       " ['DEPENDS_ON', 'Interface'],\n",
       " ['DEPENDS_ON', 'ManagedResource'],\n",
       " ['DEPENDS_ON', 'Annotation'],\n",
       " ['DEPENDS_ON', 'Service'],\n",
       " ['DEPENDS_ON', 'Jpa'],\n",
       " ['DEPENDS_ON', 'Entity'],\n",
       " ['EXTENDS', 'File'],\n",
       " ['EXTENDS', 'Type'],\n",
       " ['EXTENDS', 'Java'],\n",
       " ['EXTENDS', 'Class'],\n",
       " ['EXTENDS', 'Spring'],\n",
       " ['EXTENDS', 'Component'],\n",
       " ['EXTENDS', 'Controller'],\n",
       " ['EXTENDS', 'Interface'],\n",
       " ['EXTENDS', 'Repository'],\n",
       " ['EXTENDS', 'Annotation'],\n",
       " ['EXTENDS', 'Service'],\n",
       " ['EXTENDS', 'ManagedResource'],\n",
       " ['EXTENDS', 'Jpa'],\n",
       " ['EXTENDS', 'Entity'],\n",
       " ['IMPLEMENTS', 'File'],\n",
       " ['IMPLEMENTS', 'Type'],\n",
       " ['IMPLEMENTS', 'Java'],\n",
       " ['IMPLEMENTS', 'Annotation'],\n",
       " ['IMPLEMENTS', 'Interface'],\n",
       " ['IMPLEMENTS', 'Repository'],\n",
       " ['IMPLEMENTS', 'Class'],\n",
       " ['IMPLEMENTS', 'Spring'],\n",
       " ['IMPLEMENTS', 'Component'],\n",
       " ['IMPLEMENTS', 'Service'],\n",
       " ['IS', 'Value'],\n",
       " ['IS', 'Class'],\n",
       " ['IS_A', 'Business'],\n",
       " ['IS_A', 'TechnicalAspect'],\n",
       " ['OF_TYPE', 'Java'],\n",
       " ['OF_TYPE', 'Parameter'],\n",
       " ['OF_TYPE', 'Value'],\n",
       " ['OF_TYPE', 'Annotation'],\n",
       " ['OF_TYPE', 'Enum'],\n",
       " ['OF_TYPE', 'Primitive'],\n",
       " ['OF_TYPE', 'Field'],\n",
       " ['OF_TYPE', 'Member'],\n",
       " ['REQUIRES', 'File'],\n",
       " ['REQUIRES', 'Artifact'],\n",
       " ['REQUIRES', 'Maven'],\n",
       " ['REQUIRES', 'Container'],\n",
       " ['REQUIRES', 'Directory'],\n",
       " ['REQUIRES', 'Java'],\n",
       " ['REQUIRES', 'Main'],\n",
       " ['RETURNS', 'Java'],\n",
       " ['RETURNS', 'Member'],\n",
       " ['RETURNS', 'Method'],\n",
       " ['RETURNS', 'Test'],\n",
       " ['RETURNS', 'Junit4'],\n",
       " ['RETURNS', 'Constructor'],\n",
       " ['RETURNS', 'Spring'],\n",
       " ['RETURNS', 'ManagedAttribute'],\n",
       " ['RETURNS', 'ManagedOperation'],\n",
       " ['THROWS', 'Java'],\n",
       " ['THROWS', 'Member'],\n",
       " ['THROWS', 'Method'],\n",
       " ['THROWS', 'Test'],\n",
       " ['THROWS', 'Junit4'],\n",
       " ['USES', 'File'],\n",
       " ['USES', 'Type'],\n",
       " ['USES', 'Repository'],\n",
       " ['USES', 'Java'],\n",
       " ['USES', 'Class'],\n",
       " ['USES', 'Spring'],\n",
       " ['USES', 'Component'],\n",
       " ['USES', 'Service'],\n",
       " ['USES', 'Interface'],\n",
       " ['USES', 'Controller']]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (:Type:Java)-[r]-(n)\n",
    "WITH DISTINCT labels(n) as node_labels, type(r) as rel_types\n",
    "UNWIND node_labels as node_label\n",
    "RETURN DISTINCT rel_types as Relationship, node_label as Nodes\n",
    "ORDER BY Relationship"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Elements of methods in Java"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Java method node properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Properties</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>abstract</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>cyclomaticComplexity</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>effectiveLineCount</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>firstLineNumber</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>lastLineNumber</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>name</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>signature</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>static</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>synthetic</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>visibility</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['abstract'],\n",
       " ['cyclomaticComplexity'],\n",
       " ['effectiveLineCount'],\n",
       " ['firstLineNumber'],\n",
       " ['lastLineNumber'],\n",
       " ['name'],\n",
       " ['signature'],\n",
       " ['static'],\n",
       " ['synthetic'],\n",
       " ['visibility']]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (m:Method:Java)-[]-()\n",
    "WITH DISTINCT keys(m) as keys \n",
    "UNWIND keys as key\n",
    "RETURN DISTINCT key as Properties\n",
    "ORDER BY Properties"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Java method node relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>RelationshipTypes</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>DECLARES</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>RETURNS</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>INVOKES</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>READS</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>WRITES</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>HAS</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>ANNOTATED_BY</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>THROWS</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['DECLARES'],\n",
       " ['RETURNS'],\n",
       " ['INVOKES'],\n",
       " ['READS'],\n",
       " ['WRITES'],\n",
       " ['HAS'],\n",
       " ['ANNOTATED_BY'],\n",
       " ['THROWS']]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (:Method:Java)-[r]-()\n",
    "WITH DISTINCT type(r) as rels_type \n",
    "RETURN DISTINCT(rels_type) as RelationshipTypes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Listing possible code smells"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Statische, geschriebene Variablen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>InClass</th>\n",
       "            <th>theMethod</th>\n",
       "            <th>writesInLine</th>\n",
       "            <th>toStaticField</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>OwnerController</td>\n",
       "            <td>processFindForm</td>\n",
       "            <td>112</td>\n",
       "            <td>ownersIndexes</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>OwnerController</td>\n",
       "            <td>processFindForm</td>\n",
       "            <td>112</td>\n",
       "            <td>ownersIndexes</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>BrokenSingleton</td>\n",
       "            <td>getInstance</td>\n",
       "            <td>11</td>\n",
       "            <td>INSTANCE</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['OwnerController', 'processFindForm', 112, 'ownersIndexes'],\n",
       " ['OwnerController', 'processFindForm', 112, 'ownersIndexes'],\n",
       " ['BrokenSingleton', 'getInstance', 11, 'INSTANCE']]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (c:Class)-[:DECLARES]->(f:Field)<-[w:WRITES]-(m:Method)\n",
    "WHERE \n",
    "    EXISTS(f.static) AND NOT EXISTS(f.final)\n",
    "RETURN \n",
    "    c.name as InClass, \n",
    "    m.name as theMethod, \n",
    "    w.lineNumber as writesInLine, \n",
    "    f.name as toStaticField"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add subdomain information to types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7 nodes created.\n",
      "7 properties set.\n",
      "10 relationships created.\n",
      "7 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>s.name</th>\n",
       "            <th>t.name</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>Clinic</td>\n",
       "            <td>ClinicService</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Clinic</td>\n",
       "            <td>ClinicServiceImpl</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Clinic</td>\n",
       "            <td>AbstractClinicServiceTests</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Clinic</td>\n",
       "            <td>ClinicServiceJdbcTests</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Clinic</td>\n",
       "            <td>ClinicServiceJpaTests</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Clinic</td>\n",
       "            <td>ClinicServiceSpringDataJpaTests</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Owner</td>\n",
       "            <td>Owner</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Owner</td>\n",
       "            <td>JdbcOwnerRepositoryImpl</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Owner</td>\n",
       "            <td>OwnerRepository</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Owner</td>\n",
       "            <td>JpaOwnerRepositoryImpl</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Clinic', 'ClinicService'],\n",
       " ['Clinic', 'ClinicServiceImpl'],\n",
       " ['Clinic', 'AbstractClinicServiceTests'],\n",
       " ['Clinic', 'ClinicServiceJdbcTests'],\n",
       " ['Clinic', 'ClinicServiceJpaTests'],\n",
       " ['Clinic', 'ClinicServiceSpringDataJpaTests'],\n",
       " ['Owner', 'Owner'],\n",
       " ['Owner', 'JdbcOwnerRepositoryImpl'],\n",
       " ['Owner', 'OwnerRepository'],\n",
       " ['Owner', 'JpaOwnerRepositoryImpl']]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "\n",
    "UNWIND [\n",
    "        { name: \"Clinic\" },\n",
    "        { name: \"Owner\" },\n",
    "        { name: \"Person\" }, \n",
    "        { name: \"Pet\" },\n",
    "        { name: \"Specialty\" },\n",
    "        { name: \"Vet\" }, \n",
    "        { name: \"Visit\" }\n",
    "    ]\n",
    "    AS properties\n",
    "CREATE (s:Subdomain) SET s = properties\n",
    "WITH s\n",
    "        MATCH (t:Type)\n",
    "            WHERE t.name CONTAINS s.name\n",
    "        MERGE (t)-[:BELONGS_TO]->(s)\n",
    "RETURN s.name, t.name\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Count types per Subdomain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>ASubdomain</th>\n",
       "            <th>Types</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>crossfunctional</td>\n",
       "            <td>19</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Pet</td>\n",
       "            <td>17</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Vet</td>\n",
       "            <td>9</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Visit</td>\n",
       "            <td>9</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Owner</td>\n",
       "            <td>7</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Clinic</td>\n",
       "            <td>6</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Person</td>\n",
       "            <td>1</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Specialty</td>\n",
       "            <td>1</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['crossfunctional', 19],\n",
       " ['Pet', 17],\n",
       " ['Vet', 9],\n",
       " ['Visit', 9],\n",
       " ['Owner', 7],\n",
       " ['Clinic', 6],\n",
       " ['Person', 1],\n",
       " ['Specialty', 1]]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH \n",
    "  (t:Type)-[:BELONGS_TO]->(s:Subdomain)\n",
    "RETURN \n",
    "  s.name as ASubdomain,\n",
    "  COUNT(DISTINCT t) as Types\n",
    "ORDER BY Types DESC"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Aggregate cyclomatic complexity by Subdomains"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>ASubdomain</th>\n",
       "            <th>Types</th>\n",
       "            <th>CC</th>\n",
       "            <th>Lines</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>Owner</td>\n",
       "            <td>7</td>\n",
       "            <td>1.4625000000000001</td>\n",
       "            <td>722</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>crossfunctional</td>\n",
       "            <td>17</td>\n",
       "            <td>1.2666666666666662</td>\n",
       "            <td>405</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Vet</td>\n",
       "            <td>8</td>\n",
       "            <td>1.2500000000000007</td>\n",
       "            <td>485</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Pet</td>\n",
       "            <td>17</td>\n",
       "            <td>1.2345679012345672</td>\n",
       "            <td>1100</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Visit</td>\n",
       "            <td>8</td>\n",
       "            <td>1.2105263157894735</td>\n",
       "            <td>564</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Clinic</td>\n",
       "            <td>6</td>\n",
       "            <td>1.0</td>\n",
       "            <td>387</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Person</td>\n",
       "            <td>1</td>\n",
       "            <td>1.0</td>\n",
       "            <td>53</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>Specialty</td>\n",
       "            <td>1</td>\n",
       "            <td>1.0</td>\n",
       "            <td>32</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Owner', 7, 1.4625000000000001, 722],\n",
       " ['crossfunctional', 17, 1.2666666666666662, 405],\n",
       " ['Vet', 8, 1.2500000000000007, 485],\n",
       " ['Pet', 17, 1.2345679012345672, 1100],\n",
       " ['Visit', 8, 1.2105263157894735, 564],\n",
       " ['Clinic', 6, 1.0, 387],\n",
       " ['Person', 1, 1.0, 53],\n",
       " ['Specialty', 1, 1.0, 32]]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH \n",
    "  (m:Method)<-[:DECLARES]-(t:Type)-[:BELONGS_TO]->(s:Subdomain)\n",
    "RETURN \n",
    "  s.name as ASubdomain,\n",
    "  COUNT(DISTINCT t) as Types,\n",
    "  AVG(m.cyclomaticComplexity) as CC,\n",
    "  SUM(DISTINCT t.lastMethodLineNumber) as Lines\n",
    "ORDER BY CC DESC, Lines DESC"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
